In [2]:
## Vendas por Cidade

In [3]:
import pandas as pd

In [9]:
df1 = pd.read_excel("datasets/Aracaju.xlsx")
df2 = pd.read_excel("datasets/Fortaleza.xlsx")
df3 = pd.read_excel("datasets/Natal.xlsx")
df4 = pd.read_excel("datasets/Recife.xlsx")
df5 = pd.read_excel("datasets/Salvador.xlsx")

In [10]:
df1.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [11]:
## juntando os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [12]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [13]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [14]:
df.sample(10)

        Cidade       Data  Vendas  LojaID  Qtde
119   Salvador 2019-03-02  136.37    1034     2
101    Aracaju 2018-01-01   16.62    1520     9
48      Recife 2019-01-01  141.19     980     7
66       Natal 2019-03-24  559.00     853     2
129      Natal 2019-01-02  125.66    1037     1
17     Aracaju 2018-01-01  162.19    1522     9
80      Recife 2019-01-01  114.14     982     8
183   Salvador 2019-01-02  120.23    1037     2
141   Salvador 2019-03-02    9.08    1036     1
141  Fortaleza 2019-03-02  182.75     983     8

In [15]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [16]:
# alterando tipo de dado
df["LojaID"] = df["LojaID"].astype("object")

In [17]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [18]:
## Valores faltante
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [20]:
## Valores Nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [21]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [22]:
df["Vendas"].mean()

122.61180089485438

In [23]:
## Valores Nulos por 0
df["Vendas"].fillna(0, inplace=True)

In [24]:
## Apagando linhas com valores Nulos

In [25]:
df.dropna(inplace=True)

In [26]:
## Apagando linhas com valores Nulos em uma coluna
df.dropna(subset=["Vendas"], inplace=True)

### Nova culuna

In [27]:
### Coluna Receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [28]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [29]:
# maior receita
df["Receita"].max()

3544.0

In [30]:
# menor receita
df["Receita"].min()

3.34

In [31]:
# nlargest
df.nlargest(3,"Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
51  Natal 2018-01-21   859.0    852     4   3436.0
55  Natal 2019-01-08   859.0    854     4   3436.0

In [32]:
# nsamllest
df.nsmallest(3,"Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita
118  Aracaju 2018-01-01    3.34   1522     1     3.34
65    Recife 2019-01-01    4.01    981     1     4.01
92     Natal 2019-01-02    4.57   1035     1     4.57

In [33]:
# Agrupando por Cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [34]:
# ordenando conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
55  Natal 2019-01-08   859.0    854     4   3436.0
51  Natal 2018-01-21   859.0    852     4   3436.0
30  Natal 2018-10-02   856.0    853     4   3424.0
41  Natal 2018-05-20   835.0    852     4   3340.0
38  Natal 2018-02-25   828.0    852     4   3312.0
10  Natal 2018-10-27   828.0    852     4   3312.0
69  Natal 2019-03-24   817.0    852     4   3268.0
62  Natal 2018-02-10   793.0    854     4   3172.0
52  Natal 2018-04-27   778.0    854     4   3112.0

## Data

In [35]:
# agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [36]:
# culuna com ano_venda
df["Ano_Venda"] = df["Data"].dt.year

In [39]:
df.sample(10)

        Cidade       Data  Vendas LojaID  Qtde  Receita  Ano_Venda
142      Natal 2019-01-02    7.12   1034     1     7.12       2019
61   Fortaleza 2019-01-01   37.41   1002     5   187.05       2019
79   Fortaleza 2019-01-01   41.25   1005     6   247.50       2019
50     Aracaju 2018-01-01    7.52   1522     5    37.60       2018
103     Recife 2019-01-01   41.65    982     3   124.95       2019
72       Natal 2018-05-02  612.00    854     4  2448.00       2018
38      Recife 2019-01-01  104.53    983     4   418.12       2019
92   Fortaleza 2019-01-01    3.49   1005     4    13.96       2019
194   Salvador 2019-01-02  156.47   1035     1   156.47       2019
26     Aracaju 2018-01-01    6.98   1521    10    69.80       2018

In [41]:
# extraindo mês e o dia de venda
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [42]:
df.sample(10)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Ano_Venda,mes_venda,dia_venda
151,Salvador,2019-01-02,14.63,1035,1,14.63,2019,1,2
128,Aracaju,2018-01-01,37.49,1521,2,74.98,2018,1,1
33,Recife,2019-01-01,32.33,982,1,32.33,2019,1,1
228,Natal,2019-01-02,6.87,1037,3,20.61,2019,1,2
238,Salvador,2019-01-03,139.64,1035,1,139.64,2019,1,3
103,Recife,2019-01-01,41.65,982,3,124.95,2019,1,1
84,Salvador,2019-01-01,22.99,1036,1,22.99,2019,1,1
174,Salvador,2019-01-02,35.30,1037,1,35.30,2019,1,2
194,Natal,2019-01-02,156.47,1035,1,156.47,2019,1,2
198,Natal,2019-01-02,13.65,1037,3,40.95,2019,1,2

In [43]:
# coluna trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [49]:
df.sample(10)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Ano_Venda,mes_venda,dia_venda,trimestre_venda
126,Natal,2019-01-02,41.69,1036,2,83.38,2019,1,2,1
205,Salvador,2019-01-02,196.09,1037,1,196.09,2019,1,2,1
41,Salvador,2019-02-13,9.86,1035,2,19.72,2019,2,13,1
4,Salvador,2019-02-14,19.47,1037,3,58.41,2019,2,14,1
196,Natal,2019-01-02,145.09,1036,2,290.18,2019,1,2,1
5,Natal,2019-03-30,674.00,854,2,1348.00,2019,3,30,1
145,Salvador,2019-01-02,84.62,1034,2,169.24,2019,1,2,1
47,Aracaju,2018-01-01,80.46,1520,2,160.92,2018,1,1,1
64,Recife,2019-01-01,89.32,983,2,178.64,2019,1,1,1
64,Fortaleza,2019-01-01,110.31,1005,4,441.24,2019,1,1,1

In [51]:
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [52]:
vendas_marco_19.sample(10)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Ano_Venda,mes_venda,dia_venda,trimestre_venda
120,Fortaleza,2019-03-02,184.90,982,4,739.60,2019,3,2,1
108,Salvador,2019-03-02,11.72,1037,1,11.72,2019,3,2,1
115,Salvador,2019-03-02,202.33,1035,2,404.66,2019,3,2,1
110,Recife,2019-03-02,51.98,983,6,311.88,2019,3,2,1
7,Natal,2019-03-18,886.00,853,4,3544.00,2019,3,18,1
131,Recife,2019-03-02,139.07,982,6,834.42,2019,3,2,1
136,Salvador,2019-03-02,13.81,1036,1,13.81,2019,3,2,1
8,Natal,2019-03-27,667.00,852,4,2668.00,2019,3,27,1
133,Recife,2019-03-02,14.67,980,7,102.69,2019,3,2,1
140,Recife,2019-03-02,166.89,983,5,834.45,2019,3,2,1

In [64]:
vendas_setembro_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 9)]

In [66]:
vendas_setembro_19.sample(10)

ValueError: a must be greater than 0 unless no samples are taken